GIT - распределенная система контрооля версий, это сиситема для отслеживания и ведения истории изменений ваших файлов или проекта.

Рапозитоорий - хранилище ваших файлов, которые вы отслеживаете при помощи гита и их изменений.

Команды GIT:
1. git init - она создает новый гит репозиторий локально на вашем пк, создаст она в той директории где вы запускаете эту команду.
2. git add - когда мы создаем и изменяем файлы, то при помощи этой команды мы загружаем все изменения в промежуточное место хранение "git add 'file name'", "git add . -> все в текущей директории"
3. git commit - как только мы достигаем определенного момента в разработке, то мв сохраняем и комментируем все наши изменения в репозиторий. (фиксация изменений в репористории) "git commit -m '<comment>'".
.
